# IsValidGlobalParameter Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
GlobalParametersManager..::..IsValidGlobalParameter Method
GlobalParametersManager Class See Also
---
Tests whether an ElementId is of a global parameter in the given document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016 Subscription Update
# Syntax
C#
---
```text
public static bool IsValidGlobalParameter(
	Document document,
	ElementId parameterId
)
```

Visual Basic
---
```text
Public Shared Function IsValidGlobalParameter ( _
	document As Document, _
	parameterId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsValidGlobalParameter(
	Document^ document,
	ElementId^ parameterId
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document containing the global parameter.
parameterId
    Type: Autodesk.Revit.DB..::..ElementId Id of a global parameter
# ### Return Value
Returns True if the Id is of a valid global parameter; False otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
GlobalParametersManager Class
Autodesk.Revit.DB Namespace